### Урок 3. Библиотека Pandas

### Анализ данных с помощью библиотеки Pandas

<img width = '700px' src="images/lesson_3/1_ltQN5rQ5tI0fcQz7fMqsww.png">

**Pandas** это высокоуровневая Python библиотека для анализа данных, построена она поверх более низкоуровневой библиотеки NumPy (написана на Си), что является большим плюсом в производительности. В экосистеме Python, pandas является наиболее продвинутой и быстроразвивающейся библиотекой для обработки и анализа данных.

Основными структурами данных в Pandas являются классы **Series** и **DataFrame**.

### Pandas Series

Структура/объект Series представляет из себя объект, похожий на одномерный массив (питоновский список, например), но отличительной его чертой является наличие ассоциированных меток, т.н. индексов, вдоль каждого элемента из списка. Такая особенность превращает его в ассоциативный массив или словарь в Python.

In [2]:
import pandas as pd
import numpy as np
my_series = pd.Series([5, 6, 7, 8, 9, 10])
my_series

0     5
1     6
2     7
3     8
4     9
5    10
dtype: int64

In [3]:
my_series.index

RangeIndex(start=0, stop=6, step=1)

In [4]:
my_series.values

array([ 5,  6,  7,  8,  9, 10])

In [5]:
my_series2 = pd.Series([5, 6, 7, 8, 9, 10], index=['a', 'b', 'c', 'd', 'e', 'f'])
my_series2

a     5
b     6
c     7
d     8
e     9
f    10
dtype: int64

In [6]:
my_series2.index

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [7]:
my_series[[4]]

4    9
dtype: int64

In [8]:
my_series2[['a']]

a    5
dtype: int64

In [9]:
my_series2[['a', 'b', 'f']] = 0
my_series2

a    0
b    0
c    7
d    8
e    9
f    0
dtype: int64

In [10]:
my_series2[(my_series2 > 0)]

c    7
d    8
e    9
dtype: int64

In [11]:
my_series3 = pd.Series({'a': 5, 'b': 6, 'c': 7, 'd': 8})
my_series3

a    5
b    6
c    7
d    8
dtype: int64

In [12]:
my_series3.name = 'numbers'
my_series3.index.name = 'letters'
my_series3

letters
a    5
b    6
c    7
d    8
Name: numbers, dtype: int64

### Pandas DataFrame

Объект DataFrame лучше всего представлять себе в виде обычной таблицы и это правильно, ведь DataFrame является табличной структурой данных. В любой таблице всегда присутствуют строки и столбцы. Столбцами в объекте DataFrame выступают объекты Series, строки которых являются их непосредственными элементами.

In [13]:
df = pd.DataFrame({
    'country': ['Kazakhstan', 'Russia', 'Belarus', 'Ukraine'],
    'population': [17.04, 143.5, 9.5, 45.5],
    'square': [2724902, 17125191, 207600, 603628]
})
df

      country  population    square
0  Kazakhstan       17.04   2724902
1      Russia      143.50  17125191
2     Belarus        9.50    207600
3     Ukraine       45.50    603628

In [14]:
df.population

0     17.04
1    143.50
2      9.50
3     45.50
Name: population, dtype: float64

In [15]:
df['population']

0     17.04
1    143.50
2      9.50
3     45.50
Name: population, dtype: float64

In [16]:
type(df.population)

pandas.core.series.Series

In [19]:
df.index = ['KZ', 'RU', 'BY', 'UA']
df

       country  population    square
KZ  Kazakhstan       17.04   2724902
RU      Russia      143.50  17125191
BY     Belarus        9.50    207600
UA     Ukraine       45.50    603628

**Импорт данных**

In [20]:
# pd.read_csv('filename')
# pd.read_excel('filename')
# pd.read_sql(query,connection_object) 
# pd.read_table(filename)
# pd.read_json(json_string)
# pd.read_html(url) 
# pd.read_clipboard()
# pd.DataFrame(dict)

In [25]:
ml = pd.read_csv('files/lesson_3/meteorite-landings.csv', sep = ',')
ml.tail()

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
45711,Zillah 002,31356,Valid,Eucrite,172.0,Found,1990.0,29.03700,17.01850,"(29.037000, 17.018500)"
45712,Zinder,30409,Valid,"Pallasite, ungrouped",46.0,Found,1999.0,13.78333,8.96667,"(13.783330, 8.966670)"
45713,Zlin,30410,Valid,H4,3.3,Found,1939.0,49.25000,17.66667,"(49.250000, 17.666670)"
45714,Zubkovsky,31357,Valid,L6,2167.0,Found,2003.0,49.78917,41.50460,"(49.789170, 41.504600)"
45715,Zulu Queen,30414,Valid,L3.7,200.0,Found,1976.0,33.98333,-115.68333,"(33.983330, -115.683330)"

In [30]:
mailru = pd.read_html('https://mail.ru/')

Отдельно стоит упомянуть про возможность работы в Pandas с большими файлами, которые могут не помещаться в оперативную память компьютера. Для этого мы можем читать файл небольшими чанками.

In [88]:
c_size = 10000 

for gm_chunk in pd.read_csv('files/lesson_3/meteorite-landings.csv', sep = ',',chunksize=c_size):
    print(gm_chunk.shape)

(10000, 10)
(10000, 10)
(10000, 10)
(10000, 10)
(5716, 10)

**Экспорт данных**

In [38]:
# df.to_csv('kek.csv') 
# df.to_excel('kek.xls') 
# df.to_sql(table_name, connection_object)
# df.to_json(filename)
# df.to_html(filename)
# df.to_clipboard()

**Доступ к данным**

Доступ к строкам по индексу возможен несколькими способами:

- .loc - используется для доступа по строковой метке
- .iloc - используется для доступа по числовому значению (начиная от 0)

In [43]:
df.loc['KZ']

country       Kazakhstan
population         17.04
square           2724902
Name: KZ, dtype: object

In [32]:
df.iloc[0]

country       Kazakhstan
population         17.04
square           2724902
Name: KZ, dtype: object

In [48]:
#индекс + колонки
df.loc[['KZ', 'RU'], 'population']

KZ     17.04
RU    143.50
Name: population, dtype: float64

В .loc и .iloc запомнить, что первая часть относится к строкам, вторая - к столбцам.

In [44]:
df.iloc[[0,1],[1]]

    population
KZ       17.04
RU      143.50

In [45]:
df[df.population > 10][['country', 'square']]

       country    square
KZ  Kazakhstan   2724902
RU      Russia  17125191
UA     Ukraine    603628

In [62]:
#более сложное условие
df[(df.square > 70000) & (df.country == 'Russia')][['country', 'square']]

   country    square
RU  Russia  17125191

In [37]:
# Или так
filters = (df.country == 'Russia')
df[filters]

   country  population    square
RU  Russia       143.5  17125191

In [74]:
# Создаем новую колонку 
df['density'] = df['population'] / df['square'] * 1000000
df

       country  population    square    density
KZ  Kazakhstan       17.04   2724902   6.253436
RU      Russia      143.50  17125191   8.379469
BY     Belarus        9.50    207600  45.761079
UA     Ukraine       45.50    603628  75.377550

In [85]:
# Обратить внимание, что при дропе колонок необходимо в том или ином виде перезаписывать данные в исходном датафрейме
# df.drop(['density'], axis=1)
df.drop(['density'], axis='columns',inplace =True)
df

       country  population    square
KZ  Kazakhstan       17.04   2724902
RU      Russia      143.50  17125191
BY     Belarus        9.50    207600
UA     Ukraine       45.50    603628

In [73]:
df = df.drop(['density'], axis=1)
df

       country  population    square
KZ  Kazakhstan       17.04   2724902
RU      Russia      143.50  17125191
BY     Belarus        9.50    207600
UA     Ukraine       45.50    603628

In [78]:
df = df.rename(columns={'country_code': 'country'})
df

       country  population    square    density
KZ  Kazakhstan       17.04   2724902   6.253436
RU      Russia      143.50  17125191   8.379469
BY     Belarus        9.50    207600  45.761079
UA     Ukraine       45.50    603628  75.377550

In [79]:
# вытаскивает n самых больших показателей из колонки - нет нужды в сортировке
df.nlargest(3,'population')

       country  population    square    density
RU      Russia      143.50  17125191   8.379469
UA     Ukraine       45.50    603628  75.377550
KZ  Kazakhstan       17.04   2724902   6.253436

In [88]:
df.nsmallest(3,'square')

       country  population   square
BY     Belarus        9.50   207600
UA     Ukraine       45.50   603628
KZ  Kazakhstan       17.04  2724902

### Работа с данными с помощью Pandas

Источник данных - https://www.kaggle.com/nasa/meteorite-landings.

1).Загрузим исходные данные.

In [132]:
df = pd.read_csv('files/lesson_3/meteorite-landings.csv', sep = ',')
# df.to_csv('files/lesson_2/meteorite-landings-output.csv', index = False)

2).Посмотрим на первые 5 строк файла.

In [91]:
df.head()
# df.tail(10)

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,1880.0,50.77500,6.08333,"(50.775000, 6.083330)"
1,Aarhus,2,Valid,H6,720.0,Fell,1951.0,56.18333,10.23333,"(56.183330, 10.233330)"
2,Abee,6,Valid,EH4,107000.0,Fell,1952.0,54.21667,-113.00000,"(54.216670, -113.000000)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,1976.0,16.88333,-99.90000,"(16.883330, -99.900000)"
4,Achiras,370,Valid,L6,780.0,Fell,1902.0,-33.16667,-64.95000,"(-33.166670, -64.950000)"

По умолчанию выводится 20 столбцов и 60 строк.
Можно изменить, воспользовавшись следующей командой:

In [92]:
pd.set_option('display.max_columns', 100)
pd.set_option('display.max_rows', 100)

In [99]:
# Еще очень полезная опция
pd.set_option('display.precision',3)

3).Посмотрим на размер данных, названия признаков и их типы.

In [100]:
#45716 наблюдений и 10 колонок
df.shape

(45716, 10)

In [101]:
df.shape[0]

45716

In [102]:
df.columns

Index(['name', 'id', 'nametype', 'recclass', 'mass', 'fall', 'year', 'reclat',
       'reclong', 'GeoLocation'],
      dtype='object')

4).Посмотрим общую информацию по датафрейму.

Для просмотра числовых статистик можно воспользоваться методом *describe*:

In [103]:
df.describe()

              id       mass       year     reclat    reclong
count  45716.000  4.558e+04  45428.000  38401.000  38401.000
mean   26889.735  1.328e+04   1991.772    -39.123     61.074
std    16860.683  5.750e+05     27.181     46.379     80.647
min        1.000  0.000e+00    301.000    -87.367   -165.433
25%    12688.750  7.200e+00   1987.000    -76.714      0.000
50%    24261.500  3.260e+01   1998.000    -71.500     35.667
75%    40656.750  2.026e+02   2003.000      0.000    157.167
max    57458.000  6.000e+07   2501.000     81.167    354.473

In [104]:
df.describe(include=['object'])

                          name nametype recclass   fall           GeoLocation
count                    45716    45716    45716  45716                 38401
unique                   45716        2      466      2                 17100
top     Grove Mountains 022611    Valid       L6  Found  (0.000000, 0.000000)
freq                         1    45641     8285  44609                  6214

Также по нечисловым признакам можно изучить распределение:

In [107]:
df.recclass.value_counts()[:5]
#dropna

L6    8285
H5    7142
L5    4796
H6    4528
H4    4211
Name: recclass, dtype: int64

Информация о колонках датафрейма:

In [109]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 10 columns):
name           45716 non-null object
id             45716 non-null int64
nametype       45716 non-null object
recclass       45716 non-null object
mass           45585 non-null float64
fall           45716 non-null object
year           45428 non-null float64
reclat         38401 non-null float64
reclong        38401 non-null float64
GeoLocation    38401 non-null object
dtypes: float64(4), int64(1), object(5)
memory usage: 3.5+ MB
None

В случае работы с большими датасетами занимаемая память - критичной фактор:

In [108]:
for dtype in ['float','int','object']:
    selected_dtype = df.select_dtypes(include=[dtype])
    mean_usage_b = selected_dtype.memory_usage(deep=True).mean()
    mean_usage_mb = mean_usage_b / 1024 ** 2
    print("Average memory usage for {} columns: {:03.2f} MB".format(dtype,mean_usage_mb))

Average memory usage for float columns: 0.28 MB
Average memory usage for int columns: 0.17 MB
Average memory usage for object columns: 2.41 MB

Не забываем, что мы можем закодировать колонки типа object в числовые эквиваленты, например с помощью pd.factorize.

5).Изменим тип колонок в том случае, если это необходимо.

In [109]:
df['mass'] = df['mass'].astype('float32')

In [110]:
#Обратить внимание, как изменился размер занимаемой памяти
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 10 columns):
name           45716 non-null object
id             45716 non-null int64
nametype       45716 non-null object
recclass       45716 non-null object
mass           45585 non-null float32
fall           45716 non-null object
year           45428 non-null float64
reclat         38401 non-null float64
reclong        38401 non-null float64
GeoLocation    38401 non-null object
dtypes: float32(1), float64(3), int64(1), object(5)
memory usage: 3.3+ MB
None

**Тип данных КАТЕГОРИЯ**

Отдельный тип данных в Pandas, которому стоит уделить внимание, так как он позволяет более эффективно работать с категориальными признаками.

Что такое категориальные признаки?

In [111]:
unique_counts = pd.DataFrame.from_records([(col, df[col].nunique()) for col in df.columns],
                          columns=['Column_Name', 'Num_Unique']).sort_values(by=['Num_Unique'])
unique_counts

   Column_Name  Num_Unique
2     nametype           2
5         fall           2
6         year         268
3     recclass         466
4         mass       12576
7       reclat       12738
8      reclong       14640
9  GeoLocation       17100
0         name       45716
1           id       45716

Класс метеорита (recclass) - отличный кандидат для категориального признака.

In [112]:
df_with_cat = df.copy()

In [113]:
df_with_cat['recclass'] = df_with_cat['recclass'].astype('category')

Зачем нужны категориальные признаки в Pandas:
    - позволяют более эффективно обрабатывать категориальные признаки;
    - многие питоновские библиотеки меют встроенные методы по работе с категориальными признаками;
    - такие признаки закнимают меньше места и также положительно сказываются на производительности.

In [114]:
print(df_with_cat.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 10 columns):
name           45716 non-null object
id             45716 non-null int64
nametype       45716 non-null object
recclass       45716 non-null category
mass           45585 non-null float32
fall           45716 non-null object
year           45428 non-null float64
reclat         38401 non-null float64
reclong        38401 non-null float64
GeoLocation    38401 non-null object
dtypes: category(1), float32(1), float64(3), int64(1), object(4)
memory usage: 3.1+ MB
None

In [115]:
%%timeit
df_with_cat.groupby('recclass')['mass'].mean().to_frame()

8.51 ms ± 379 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [116]:
%%timeit
df.groupby('recclass')['mass'].mean().to_frame()

16.8 ms ± 97.2 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

Заметный прирост производительности!

Используйте данный тип с осторожностью, всегда выполняется необходимую предобработку данных.

6).Применить к данным требуемые операции.

In [117]:
#Сортировка
df.sort_values(by=['recclass', 'mass'], ascending=[True, False]).head(2)

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
27673,Northwest Africa 2656,32485,Valid,Acapulcoite,7500.0,Found,2003.0,NaN,NaN,NaN
30353,Northwest Africa 725,17807,Valid,Acapulcoite,3824.0,Found,NaN,30.6,-5.05,"(30.600000, -5.050000)"

In [118]:
#Извлечение данных
df.loc[0:5,:]

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,1880.0,50.775,6.083,"(50.775000, 6.083330)"
1,Aarhus,2,Valid,H6,720.0,Fell,1951.0,56.183,10.233,"(56.183330, 10.233330)"
2,Abee,6,Valid,EH4,107000.0,Fell,1952.0,54.217,-113.000,"(54.216670, -113.000000)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,1976.0,16.883,-99.900,"(16.883330, -99.900000)"
4,Achiras,370,Valid,L6,780.0,Fell,1902.0,-33.167,-64.950,"(-33.166670, -64.950000)"
5,Adhi Kot,379,Valid,EH4,4239.0,Fell,1919.0,32.100,71.800,"(32.100000, 71.800000)"

In [119]:
df[df['name'] == 'Abee']['mass'].mean()

107000.0

In [133]:
df.fall.value_counts()

Found    44609
Fell      1107
Name: fall, dtype: int64

In [134]:
#Применение функции к каждому столбцу/строке
df[['mass', 'id']].apply(np.max)

mass    6.000e+07
id      5.746e+04
dtype: float64

In [136]:
#Замена значений в колонке
d = {'Found' : 1, 'Fell' : 0}
df['status'] = df['fall'].map(d)
df.tail(2)

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation,status
45714,Zubkovsky,31357,Valid,L6,2167.0,Found,2003.0,49.789,41.505,"(49.789170, 41.504600)",1
45715,Zulu Queen,30414,Valid,L3.7,200.0,Found,1976.0,33.983,-115.683,"(33.983330, -115.683330)",1

In [137]:
#Группировка данных
#df.groupby(by=grouping_columns)[columns_to_show].function()

df.groupby(by = 'fall')['mass'].max()

fall
Fell     2.300e+07
Found    6.000e+07
Name: mass, dtype: float64

In [144]:
df.groupby(by = ['fall', 'recclass'])['mass'].agg([np.mean, np.std, np.min, np.max])

                                 mean        std        amin       amax
fall  recclass
Fell  Acapulcoite           1.914e+03        NaN    1914.000  1.914e+03
      Achondrite-ung        1.500e-01        NaN       0.150  1.500e-01
      Angrite               1.500e+03        NaN    1500.000  1.500e+03
      Aubrite               1.341e+05  3.629e+05     800.000  1.100e+06
      C                     9.925e+02        NaN     992.500  9.925e+02
      C2-ung                3.625e+03  5.521e+03     375.000  1.000e+04
      C3-ung                4.610e+03        NaN    4610.000  4.610e+03
      CBa                   1.000e+05        NaN  100000.000  1.000e+05
      CI1                   4.143e+03  6.056e+03       1.000  1.400e+04
      CK4                   2.093e+04  2.941e+04     136.000  4.173e+04
      CM2                   8.877e+03  2.548e+04      25.810  1.000e+05
      CO3.2                 2.000e+05        NaN  200000.000  2.000e+05
      CO3.3                 3.200e+03        NaN    3200.000  3.200e+03
      CO3.4                 6.000e+03        NaN    6000.000  6.000e+03
      CO3.5                 5.170e+04        NaN   51700.000  5.170e+04
      CO3.6                 3.763e+03        NaN    3763.000  3.763e+03
      CO3.7                 1.600e+03        NaN    1600.000  1.600e+03
      CR2                   1.500e+03  7.071e+02    1000.000  2.000e+03
      CR2-an                1.600e+02        NaN     160.000  1.600e+02
      CV3                   2.903e+05  7.539e+05    1000.000  2.000e+06
      Diogenite             1.065e+04  1.468e+04      50.000  4.030e+04
      Diogenite-pm          4.066e+02  5.140e+02     102.000  1.000e+03
      EH3                   1.700e+03  1.273e+03     800.000  2.600e+03
      EH3/4-an              2.800e+01        NaN      28.000  2.800e+01
      EH4                   4.608e+04  5.397e+04    4239.000  1.070e+05
      EH5                   1.389e+04  1.556e+02   13780.000  1.400e+04
      EH7-an                4.720e+03        NaN    4720.000  4.720e+03
      EL6                   8.658e+03  8.126e+03     189.200  2.325e+04
      Eucrite               2.520e+02  1.018e+02     180.000  3.240e+02
      Eucrite-br            5.000e+02        NaN     500.000  5.000e+02
      Eucrite-cm            1.076e+03  8.425e+02      20.000  1.880e+03
      Eucrite-mmict         3.076e+04  7.859e+04      97.700  3.300e+05
      Eucrite-pmict         2.317e+03  1.714e+03     219.000  5.100e+03
      H                     2.672e+03  4.845e+03      13.900  1.745e+04
      H/L3.6                2.800e+04        NaN   28000.000  2.800e+04
      H/L3.9                7.250e+03        NaN    7250.000  7.250e+03
      H/L4                  4.780e+02        NaN     478.000  4.780e+02
      H3                    2.820e+03  1.160e+03    2000.000  3.640e+03
      H3-4                  4.670e+02        NaN     467.000  4.670e+02
      H3-5                  9.053e+03  6.915e+03     666.600  1.700e+04
      H3-6                  9.200e+04  1.174e+05    9000.000  1.750e+05
      H3.4                  1.265e+03        NaN    1265.000  1.265e+03
      H3.7                  3.618e+03        NaN    3618.000  3.618e+03
      H3.8                  2.850e+04  2.333e+04   12000.000  4.500e+04
      H3/4                  6.400e+03  7.637e+03    1000.000  1.180e+04
      H4                    2.612e+04  7.669e+04     177.000  5.000e+05
      H4-5                  3.506e+03  4.474e+03     342.000  6.669e+03
      H4-6                  1.857e+03  1.942e+03     483.700  3.230e+03
      H4-an                 1.504e+03        NaN    1504.000  1.504e+03
      H4/5                  3.052e+04  2.697e+04      27.500  7.050e+04
...                               ...        ...         ...        ...
Found Mesosiderite-A        6.235e+03  8.436e+03     269.500  1.220e+04
      Mesosiderite-A1       1.383e+06  2.121e+06   48500.000  3.828e+06
      Mesosiderite-A2       4.949e+03  4.173e+03     147.000  7.700e+03
      Mesosiderite-A3       1.650e+04  2.828e+02   16300.000  1.670e+04
      Mesosiderite-A4       1.917e+04  1.904e+04    1600.000  3.940e+04
      Mesosiderite-B        2.258e+03  3.928e+03      42.000  8.132e+03
      Mesosiderite-B1       1.324e+03  1.834e+03      70.900  4.050e+03
      Mesosiderite-B2       1.322e+03  2.533e+03      13.530  5.120e+03
      Mesosiderite-B4       3.593e+05  4.584e+05   89400.000  8.886e+05
      Mesosiderite-C        3.484e+04  8.097e+04     368.000  2.180e+05
      Mesosiderite-C2       2.561e+04  2.911e+04    5026.000  4.620e+04
      Mesosiderite-an       2.009e+03  4.005e+03       4.300  1.002e+04
      Mesosiderite?         4.140e+02        NaN     414.000  4.140e+02
      OC                    3.819e+03  2.015e+04       0.750  1.500e+05
      OC3                   9.408e+02  1.580e+03      18.000  4.500e+03
      Pallasite             6.504e+03  9.559e+03       2.700  4.470e+04
      Pallasite, PES        4.217e+04  6.220e+04     320.000  1.320e+05
      Pallasite, PMG        1.473e+05  2.826e+05       3.800  1.003e+06
      Pallasite, PMG-an     7.539e+05  1.438e+06      74.000  4.300e+06
      Pallasite, ungrouped  7.311e+03  1.515e+04      46.000  3.436e+04
      Pallasite?            1.418e+04        NaN   14180.000  1.418e+04
      R                     6.635e+01  5.379e+01      26.600  1.276e+02
      R3                    8.774e+01  2.053e+02       5.800  8.250e+02
      R3-4                  1.710e+02        NaN     171.000  1.710e+02
      R3-5                  6.042e+02  5.155e+02      18.300  1.234e+03
      R3-6                  2.044e+02  2.643e+02      23.300  8.662e+02
      R3.4                  1.050e+01        NaN      10.500  1.050e+01
      R3.5-4                2.480e+02        NaN     248.000  2.480e+02
      R3.5-6                2.050e+02        NaN     205.000  2.050e+02
      R3.6                  6.905e+02  9.285e+02      13.900  1.749e+03
      R3.7                  2.360e+02  1.640e+02     120.000  3.520e+02
      R3.8                  3.013e+02  3.817e+02       3.620  1.120e+03
      R3.8-5                1.740e+02        NaN     174.000  1.740e+02
      R3.8-6                3.331e+02  3.368e+02      75.000  7.140e+02
      R3.9                  3.056e+03  5.963e+03       6.990  1.200e+04
      R3/4                  8.065e+01  3.868e+01      53.300  1.080e+02
      R4                    2.260e+02  3.279e+02       1.100  1.675e+03
      R4/5                  1.840e+02        NaN     184.000  1.840e+02
      R5                    1.360e+03  5.246e+03       0.540  2.362e+04
      R6                    6.189e+01  7.738e+01       5.793  2.473e+02
      Relict H                    NaN        NaN         NaN        NaN
      Relict OC             0.000e+00  0.000e+00       0.000  0.000e+00
      Relict iron           0.000e+00        NaN       0.000  0.000e+00
      Stone-uncl            3.286e+04  6.909e+04       3.940  1.730e+05
      Stone-ung             6.300e-01        NaN       0.630  6.300e-01
      Unknown                     NaN        NaN         NaN        NaN
      Ureilite              4.802e+02  1.485e+03       0.500  1.173e+04
      Ureilite-an           3.995e+02  6.629e+02       3.100  1.165e+03
      Ureilite-pmict        2.627e+02  4.765e+02       2.470  2.106e+03
      Winonaite             1.170e+03  4.870e+03       1.500  2.400e+04

[581 rows x 4 columns]

In [145]:
#Cводные таблицы
pd.crosstab(df['fall'], df['nametype'])

nametype  Relict  Valid
fall
Fell           0   1107
Found         75  44534

In [147]:
pd.crosstab(df['fall'], df['nametype'], normalize = True)

nametype  Relict  Valid
fall
Fell       0.000  0.024
Found      0.002  0.974

### Merge, join, and concatenate

Классическая статья из документации Pandas - http://pandas.pydata.org/pandas-docs/stable/merging.html

In [148]:
raw_data = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 
        'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}
df_a = pd.DataFrame(raw_data, columns = ['subject_id', 'first_name', 'last_name'])
df_a.index = [0,1,2,3,4]
df_a

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches

In [149]:
raw_data = {
        'subject_id': ['4', '5', '6', '7', '8'],
        'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
        'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}
df_b = pd.DataFrame(raw_data, columns = ['subject_id', 'first_name', 'last_name'])
df_b.index = [2,3,4,5,6]
df_b

  subject_id first_name last_name
2          4      Billy    Bonder
3          5      Brian     Black
4          6       Bran   Balwner
5          7      Bryce     Brice
6          8      Betty    Btisan

In [150]:
raw_data = {
        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}
df_n = pd.DataFrame(raw_data, columns = ['subject_id','test_id'])
df_n

  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

**Concat** как правило используется для объединения таблиц по вертикальной или горизонтальной оси.

In [155]:
df_new = pd.concat([df_a, df_b])
df_new

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
2          4      Billy    Bonder
3          5      Brian     Black
4          6       Bran   Balwner
5          7      Bryce     Brice
6          8      Betty    Btisan

<img width = '400px' src="images/lesson_3/merging_concat_basic.png">

In [157]:
df_new_ = pd.concat([df_a, df_b],axis = 1)
df_new_

  subject_id first_name last_name subject_id first_name last_name
0          1       Alex  Anderson        NaN        NaN       NaN
1          2        Amy  Ackerman        NaN        NaN       NaN
2          3      Allen       Ali          4      Billy    Bonder
3          4      Alice      Aoni          5      Brian     Black
4          5     Ayoung   Atiches          6       Bran   Balwner
5        NaN        NaN       NaN          7      Bryce     Brice
6        NaN        NaN       NaN          8      Betty    Btisan

In [158]:
df_new_ = pd.concat([df_a, df_b.reset_index()],axis = 1)
df_new_

  subject_id first_name last_name  index subject_id first_name last_name
0          1       Alex  Anderson      2          4      Billy    Bonder
1          2        Amy  Ackerman      3          5      Brian     Black
2          3      Allen       Ali      4          6       Bran   Balwner
3          4      Alice      Aoni      5          7      Bryce     Brice
4          5     Ayoung   Atiches      6          8      Betty    Btisan

<img width = '800px' src="images/lesson_3/merging_concat_axis1.png">

<img width = '800px' src="images/lesson_3/join-types-merge-names.jpg">

In [167]:
#Concat, но только с помощью атрибута "inner"
df_new_ = pd.concat([df_a, df_b],axis = 1,join='inner')
df_new_

  subject_id first_name last_name subject_id first_name last_name
2          3      Allen       Ali          4      Billy    Bonder
3          4      Alice      Aoni          5      Brian     Black
4          5     Ayoung   Atiches          6       Bran   Balwner

<img width = '800px' src="images/lesson_3/merging_concat_axis1_inner.png">

**Append** - частный случай метода **Concat** с параметрами (axis=0, join='outer').

In [168]:
df_a.append(df_b)

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
2          4      Billy    Bonder
3          5      Brian     Black
4          6       Bran   Balwner
5          7      Bryce     Brice
6          8      Betty    Btisan

Метод **Join** основан на объединении таблиц через индексы (способ объединения указывается с помощью параметра how = ['left','right','inner','couter']).

In [173]:
# df_a.join(df_b,how = 'left')
df_a.join(df_b,rsuffix='_right_table',how = 'left')

,subject_id,first_name,last_name,subject_id_right_table,first_name_right_table,last_name_right_table
0,1,Alex,Anderson,NaN,NaN,NaN
1,2,Amy,Ackerman,NaN,NaN,NaN
2,3,Allen,Ali,4,Billy,Bonder
3,4,Alice,Aoni,5,Brian,Black
4,5,Ayoung,Atiches,6,Bran,Balwner

<img width = '800px' src="images/lesson_3/merging_join.png">

**Merge** используется для объединения таблиц по любым колонкам с помощью методов left_on и right_on.

In [176]:
df_new

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
2          4      Billy    Bonder
3          5      Brian     Black
4          6       Bran   Balwner
5          7      Bryce     Brice
6          8      Betty    Btisan

In [177]:
df_n

  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

In [75]:
#Стоит обратить внимание, что колонка subject_id не дублируется в новой таблице
pd.merge(df_new, df_n, on='subject_id')

  subject_id first_name last_name  test_id
0          1       Alex  Anderson       51
1          2        Amy  Ackerman       15
2          3      Allen       Ali       15
3          4      Alice      Aoni       61
4          4      Billy    Bonder       61
5          5     Ayoung   Atiches       16
6          5      Brian     Black       16
7          7      Bryce     Brice       14
8          8      Betty    Btisan       15

In [76]:
pd.merge(df_new, df_n, left_on='subject_id', right_on='subject_id')

  subject_id first_name last_name  test_id
0          1       Alex  Anderson       51
1          2        Amy  Ackerman       15
2          3      Allen       Ali       15
3          4      Alice      Aoni       61
4          4      Billy    Bonder       61
5          5     Ayoung   Atiches       16
6          5      Brian     Black       16
7          7      Bryce     Brice       14
8          8      Betty    Btisan       15

In [77]:
pd.merge(df_a, df_b, on='subject_id', how='left')

  subject_id first_name_x last_name_x first_name_y last_name_y
0          1         Alex    Anderson          NaN         NaN
1          2          Amy    Ackerman          NaN         NaN
2          3        Allen         Ali          NaN         NaN
3          4        Alice        Aoni        Billy      Bonder
4          5       Ayoung     Atiches        Brian       Black

<img width = '800px' src="images/lesson_3/merging_merge_on_key_left.png">

In [78]:
pd.merge(df_a, df_b, on='subject_id', how='right')

  subject_id first_name_x last_name_x first_name_y last_name_y
0          4        Alice        Aoni        Billy      Bonder
1          5       Ayoung     Atiches        Brian       Black
2          6          NaN         NaN         Bran     Balwner
3          7          NaN         NaN        Bryce       Brice
4          8          NaN         NaN        Betty      Btisan

<img width = '800px' src="images/lesson_3/merging_merge_on_key_right.png">

In [79]:
pd.merge(df_a, df_b, right_index=True, left_index=True)

  subject_id_x first_name_x last_name_x subject_id_y first_name_y last_name_y
2            3        Allen         Ali            4        Billy      Bonder
3            4        Alice        Aoni            5        Brian       Black
4            5       Ayoung     Atiches            6         Bran     Balwner